RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_spi.h
/* SPI_CFG1 */
#define SPI_CFG1_MSSD                   BITS(0,3)                               /*!< delay between active edge of NSS and start transfer or receive data in SPI master mode */
#define SPI_CFG1_MDFD                   BITS(4,7)                               /*!< delay between the data frames in SPI master mode */
#define SPI_CFG1_SWPMIO                 BIT(15)                                 /*!< MOSI and MISO pin swap */
#define SPI_CFG1_RO                     BIT(16)                                 /*!< receive only */
#define SPI_CFG1_BDOEN                  BIT(17)                                 /*!< bidirectional transmit output enable */
#define SPI_CFG1_BDEN                   BIT(18)                                 /*!< bidirectional enable */
#define SPI_CFG1_TMOD                   BIT(21)                                 /*!< SPI TI mode enable */
#define SPI_CFG1_MSTMOD                 BIT(22)                                 /*!< Master mode enable */
#define SPI_CFG1_LF                     BIT(23)                                 /*!< LSB first mode */
#define SPI_CFG1_CKPH                   BIT(24)                                 /*!< clock phase selection */
#define SPI_CFG1_CKPL                   BIT(25)                                 /*!< clock polarity selection */
#define SPI_CFG1_NSSIM                  BIT(26)                                 /*!< NSS input signal manage mode */
#define SPI_CFG1_NSSIOPL                BIT(28)                                 /*!< NSS pin input/output polarity selection */
#define SPI_CFG1_NSSDRV                 BIT(29)                                 /*!< NSS pin output enable in master mode */
#define SPI_CFG1_NSSCTL                 BIT(30)                                 /*!< NSS pin output control in master mode */
#define SPI_CFG1_AFCTL                  BIT(31)                                 /*!< AF GPIOs control */

/* SPI_INT */
#define SPI_INT_RPIE                    BIT(0)                                  /*!< RP interrupt enable */
#define SPI_INT_TPIE                    BIT(1)                                  /*!< TP interrupt enable */
#define SPI_INT_DPIE                    BIT(2)                                  /*!< DP interrupt enable */
#define SPI_INT_ESTCIE                  BIT(3)                                  /*!< end of transfer or suspend or TXFIFO clear interrupt enable */
#define SPI_INT_TXFIE                   BIT(4)                                  /*!< transmission filled interrupt enable */
#define SPI_INT_TXUREIE                 BIT(5)                                  /*!< underrun error interrupt enable */
#define SPI_INT_RXOREIE                 BIT(6)                                  /*!< overrun error interrupt enable */
#define SPI_INT_CRCERIE                 BIT(7)                                  /*!< CRC error interrupt enable */
#define SPI_INT_FEIE                    BIT(8)                                  /*!< TI frame error interrupt enable */
#define SPI_INT_CONFEIE                 BIT(9)                                  /*!< SPI configuration error interrupt enable */
#define SPI_INT_TXSERFIE                BIT(10)                                 /*!< TXSER reload interrupt enable */

/* SPI_STAT */
#define SPI_STAT_RP                     BIT(0)                                  /*!< RxFIFO packet space available flag */
#define SPI_STAT_TP                     BIT(1)                                  /*!< TxFIFO packet space available flag */
#define SPI_STAT_DP                     BIT(2)                                  /*!< duplex packet */
#define SPI_STAT_ET                     BIT(3)                                  /*!< End of transmission/reception flag */
#define SPI_STAT_TXF                    BIT(4)                                  /*!< TxFIFO transmission has been filled */
#define SPI_STAT_TXURERR                BIT(5)                                  /*!< transmission underrun error */
#define SPI_STAT_RXORERR                BIT(6)                                  /*!< reception overrun error */
#define SPI_STAT_CRCERR                 BIT(7)                                  /*!< SPI CRC error */
#define SPI_STAT_FERR                   BIT(8)                                  /*!< SPI TI format error */
#define SPI_STAT_CONFERR                BIT(9)                                  /*!< SPI configuration error */
#define SPI_STAT_TXSERF                 BIT(10)                                 /*!< The additional SPI data has been reloaded */
#define SPI_STAT_SPD                    BIT(11)                                 /*!< suspend flag */
#define SPI_STAT_TC                     BIT(12)                                 /*!< TxFIFO transmission complete flag */
#define SPI_STAT_RPLVL                  BITS(13,14)                             /*!< RxFIFO packing level */
#define SPI_STAT_RWNE                   BIT(15)                                 /*!< the word of RXFIFO is not empty */
#define SPI_STAT_CTXSIZE                BITS(16,31)                             /*!< the number of data frames remaining in the TXSIZE session */

/* SPI_STATC */
#define SPI_STATC_ETC                   BIT(3)                                  /*!< Clear the end of transmission/reception flag */
#define SPI_STATC_TXFC                  BIT(4)                                  /*!< Clear the TxFIFO transmission filled flag */
#define SPI_STATC_TXURERRC              BIT(5)                                  /*!< clear the transmission underrun error flag */
#define SPI_STATC_RXORERRC              BIT(6)                                  /*!< clear the reception overrun error flag */
#define SPI_STATC_CRCERRC               BIT(7)                                  /*!< clear the CRC error flag */
#define SPI_STATC_FERRC                 BIT(8)                                  /*!< clear the SPI TI format error flag */
#define SPI_STATC_CONFERRC              BIT(9)                                  /*!< clear the configuration error flag */
#define SPI_STATC_TXSERFC               BIT(10)                                 /*!< clear the TXSERF flag */
#define SPI_STATC_SPDC                  BIT(11)                                 /*!< clear the suspend flag */

/* SPI_TDATA */
#define SPI_TDATA_TDATA                 BITS(0,31)                              /*!< data transfer register */

/* SPI_RDATA */
#define SPI_RDATA_RDATA                 BITS(0,31)                              /*!< data receive register */

/* SPI_CRCPOLY */
#define SPI_CRCPOLY_CRCPOLY             BITS(0,31)                              /*!< CRC polynomial register */

/* SPI_TCRC */
#define SPI_TCRC_TCRC                   BITS(0,31)                              /*!< Tx CRC register */

