RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_spi.h
/* SPI/I2S interrupt flag constants definitions */
#define SPI_I2S_INT_FLAG_RP             ((uint8_t)0x00U)                        /*!< RP interrupt flag */
#define SPI_I2S_INT_FLAG_TP             ((uint8_t)0x01U)                        /*!< TP interrupt flag */
#define SPI_I2S_INT_FLAG_DP             ((uint8_t)0x02U)                        /*!< DP interrupt flag */
#define SPI_I2S_INT_FLAG_ET             ((uint8_t)0x03U)                        /*!< end of transfer or receive interrupt flag */
#define SPI_I2S_INT_FLAG_TXF            ((uint8_t)0x04U)                        /*!< transmission filled interrupt flag */
#define SPI_I2S_INT_FLAG_TXURERR        ((uint8_t)0x05U)                        /*!< underrun error interrupt flag */
#define SPI_I2S_INT_FLAG_RXORERR        ((uint8_t)0x06U)                        /*!< overrun error interrupt flag */
#define SPI_I2S_INT_FLAG_CRCERR         ((uint8_t)0x07U)                        /*!< CRC error interrupt flag */
#define SPI_I2S_INT_FLAG_FERR           ((uint8_t)0x08U)                        /*!< TI frame error interrupt flag */
#define SPI_I2S_INT_FLAG_CONFERR        ((uint8_t)0x09U)                        /*!< mode error interrupt flag */
#define SPI_I2S_INT_FLAG_TXSERF         ((uint8_t)0x0AU)                        /*!< TXSER reload interrupt flag */
#define SPI_I2S_INT_FLAG_SPD            ((uint8_t)0x0BU)                        /*!< suspend interrupt flag */
#define SPI_I2S_INT_FLAG_TC             ((uint8_t)0x0CU)                        /*!< TXFIFO clear interrupt flag */

/* SPI/I2S flag definitions */
#define SPI_FLAG_RP                     SPI_STAT_RP                             /*!< RP flag */
#define SPI_FLAG_TP                     SPI_STAT_TP                             /*!< TP flag */
#define SPI_FLAG_DP                     SPI_STAT_DP                             /*!< DP flag */
#define SPI_FLAG_ET                     SPI_STAT_ET                             /*!< end of transfer or receive flag */
#define SPI_FLAG_TXF                    SPI_STAT_TXF                            /*!< transmission filled flag */
#define SPI_FLAG_TXURERR                SPI_STAT_TXURERR                        /*!< underrun error flag */
#define SPI_FLAG_RXORERR                SPI_STAT_RXORERR                        /*!< overrun error flag */
#define SPI_FLAG_CRCERR                 SPI_STAT_CRCERR                         /*!< CRC error flag */
#define SPI_FLAG_FERR                   SPI_STAT_FERR                           /*!< TI frame error flag */
#define SPI_FLAG_CONFERR                SPI_STAT_CONFERR                        /*!< mode error flag */
#define SPI_FLAG_TXSERF                 SPI_STAT_TXSERF                         /*!< TXSER reload flag */
#define SPI_FLAG_SPD                    SPI_STAT_SPD                            /*!< suspend flag */
#define SPI_FLAG_TC                     SPI_STAT_TC                             /*!< TXFIFO clear flag */
#define SPI_FLAG_RPLVL                  SPI_STAT_RPLVL                          /*!< RxFIFO packing level flag */
#define SPI_FLAG_RWNE                   SPI_STAT_RWNE                           /*!< the word of RXFIFO is not empty flag */
#define SPI_FLAG_CTXSIZE                SPI_STAT_CTXSIZE                        /*!< the number of data frames remaining in the TXSIZE session flag */

#define I2S_FLAG_RP                     SPI_STAT_RP                             /*!< RP flag */
#define I2S_FLAG_TP                     SPI_STAT_TP                             /*!< TP flag */
#define I2S_FLAG_DP                     SPI_STAT_DP                             /*!< DP flag */
#define I2S_FLAG_ET                     SPI_STAT_ET                             /*!< end of transfer or suspend or TXFIFO clear flag */
#define I2S_FLAG_TXF                    SPI_STAT_TXF                            /*!< transmission filled flag */
#define I2S_FLAG_TXURERR                SPI_STAT_TXURERR                        /*!< underrun error flag */
#define I2S_FLAG_RXORERR                SPI_STAT_RXORERR                        /*!< overrun error flag */

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check SPI i2s audiosample */
#define NOT_SPI_I2S_AUDIOSAMPLE(i2s_audiosample)             (((i2s_audiosample) != I2S_AUDIOSAMPLE_8K) && ((i2s_audiosample) != I2S_AUDIOSAMPLE_11K) && \
                                                              ((i2s_audiosample) != I2S_AUDIOSAMPLE_16K) && ((i2s_audiosample) != I2S_AUDIOSAMPLE_22K) && \
                                                              ((i2s_audiosample) != I2S_AUDIOSAMPLE_32K)&& ((i2s_audiosample) != I2S_AUDIOSAMPLE_44K) && \
                                                              ((i2s_audiosample) != I2S_AUDIOSAMPLE_48K)&& ((i2s_audiosample) != I2S_AUDIOSAMPLE_96K) && \
                                                              ((i2s_audiosample) != I2S_AUDIOSAMPLE_192K))
#endif

/* function declarations */
/* initialization functions */
/* reset SPI and I2S */
void spi_i2s_deinit(uint32_t spi_periph);
/* initialize the parameters of SPI struct with the default values */
void spi_struct_para_init(spi_parameter_struct *spi_struct);
/* initialize SPI parameter */
void spi_init(uint32_t spi_periph, const spi_parameter_struct *spi_struct);
/* enable SPI */
void spi_enable(uint32_t spi_periph);
/* disable SPI */
void spi_disable(uint32_t spi_periph);

/* initialize I2S parameter */
void i2s_init(uint32_t spi_periph, uint32_t i2s_mode, uint32_t i2s_standard, uint32_t i2s_ckpl);
/* configure I2S prescaler */
void i2s_psc_config(uint32_t spi_periph, uint32_t i2s_audiosample, uint32_t i2s_frameformat, uint32_t i2s_mckout);
/* enable I2S */
void i2s_enable(uint32_t spi_periph);
/* disable I2S */
void i2s_disable(uint32_t spi_periph);

/* IO swap functions */
/* SPI MOSI and MISO pin swap */
void spi_io_config(uint32_t spi_periph, uint32_t io_cfg);

/* SPI delay config functions */
/* set delay between active edge of NSS and start transfer or receive data in SPI master mode */
void spi_nss_idleness_delay_set(uint32_t spi_periph, uint32_t delay_cycle);
/* set SPI master data frame delay */
void spi_data_frame_delay_set(uint32_t spi_periph, uint32_t delay_cycle);
/* set SPI master mode rx clock delay */
void spi_master_receive_clock_delay_set(uint32_t spi_periph, uint32_t delay_unit);
/* set SPI slave mode rx clock delay */
void spi_slave_receive_clock_delay_set(uint32_t spi_periph, uint32_t delay_unit);
/* clear SPI master mode rx clock delay */
void spi_master_receive_clock_delay_clear(uint32_t spi_periph);
/* clear SPI slave mode rx clock delay */
void spi_slave_receive_clock_delay_clear(uint32_t spi_periph);

/* NSS functions */
/* NSS output control */
void spi_nss_output_control(uint32_t spi_periph, uint32_t nss_ctl);
/* set SPI NSS active polarity */
void spi_nss_polarity_set(uint32_t spi_periph, uint32_t polarity);
/* enable SPI NSS output */
void spi_nss_output_enable(uint32_t spi_periph);
/* disable SPI NSS output */
void spi_nss_output_disable(uint32_t spi_periph);
/* SPI NSS pin high level in software mode */
void spi_nss_internal_high(uint32_t spi_periph);
/* SPI NSS pin low level in software mode */
void spi_nss_internal_low(uint32_t spi_periph);

/* SPI DMA functions */
/* enable SPI DMA */
void spi_dma_enable(uint32_t spi_periph, uint8_t spi_dma);
/* disable SPI DMA */
void spi_dma_disable(uint32_t spi_periph, uint8_t spi_dma);

/* SPI/I2S transfer configure functions */
/* configure SPI/I2S data frame size */
void spi_i2s_data_frame_size_config(uint32_t spi_periph, uint32_t frame_size);
/* SPI/I2S transmit data */
void spi_i2s_data_transmit(uint32_t spi_periph, uint32_t data);
/* SPI/I2S receive data */
uint32_t spi_i2s_data_receive(uint32_t spi_periph);
/* configure SPI bidirectional transfer direction */
void spi_bidirectional_transfer_config(uint32_t spi_periph, uint32_t transfer_direction);
/* SPI/I2S master start transfer */
void spi_master_transfer_start(uint32_t spi_periph, uint32_t transfer_start);
/* configure SPI current data number */
void spi_current_data_num_config(uint32_t spi_periph, uint32_t current_num);
/* configure SPI reload data number */
void spi_reload_data_num_config(uint32_t spi_periph, uint32_t reload_num);

